{
  "iabWeight": "© 2016 IAB Technology Laboratory 6 HTML5 for Digital Advertising _v2 1 Overview Released as a Final recommendation by the World Wide Web Consortium (W3C) in October 2014, HTML5 is the latest update to the Hypertext Markup Language (HTML) that includes new semantic tags for features such as video, audio, canvas, and other design featur es. HTML5 has grown into an industry buzzword that has come to encompass all the various web technologies and APIs that work together to execute animation and other interactions. While HTML5 is code - heavy, several visual development tools have been releas ed to aid designers in developing interactive content without dealing with code. Previously known as “Flash,” the Adobe Creative Cloud animating tools also generate HTML content, which is an alternative to the Flash output that many browsers no longer acce pt. Despite the growing popularity of these tools and increased ease of use, special considerations are necessary in the ad development process to meet publisher and industry standards. This document provides an overview of the IAB Display Creative Guideli nes for Desktop and Mobile, tips on ad development that help meet these guidelines, and guidance packaging and testing your ad. 1.1 Designer’s role vs. ad technologist As a designer, your role is to create a compelling message that gets people’s attention. Bu t if your message can’t break through the technology to reach enough people, then it loses a great deal of effectiveness. Designing to overcome some of these technical barriers is part of your job as the designer. However, an ad technologist can work with you to prepare the ad for its journey through the ad storage, delivery, and ad trafficking execution systems. Ideally, designers and ad technologists work together to create an ad package that works as it was designed to. 2 IAB Display Creative Guidelines In 2015 the IAB Display Creative G uidelines (Creative Guidelines) was updated to reflect support for HTML5 ads. While the Creative Guidelines provide a reference for details, an overview is provided here in the context of HTML5 ad development. 2.1 Display in Desktop vs. Mobile Three key factors to be aware of when designing ads that might display in either a desktop or mobile environment are: screen size, connection data rate, and run - time environment. In a desktop environment, you can count on a screen size t hat is generally large enough to display any ad, but in a mobile environment, screen size varies from device to device. Depending on campaign strategy and ad serving technology, you may need to design more than one version of the ad to work in multiple env ironments. © 2016 IAB Technology Laboratory 7 HTML5 for Digital Advertising _v2 Connection data rates may be limited with mobile devices, so file weight is an important factor to consider when an ad will display in mobile devices. Even in desktop environments with high data rates, heavy file - weighted ads may delay page load and cause user drop - off. The Creative Guidelines provide file size limits that help balance ad load and page load performance. In desktop display, most ads are executed in a browser. However, in a mobile device, ads may be executed within a native applica tion. In this case, ads developed with rich interaction may need an API like MRAID to be executed. Developing an ad that accounts for screen size, connection data rate, and run - time environment results in an ad that can display almost anywhere. The followi ng overview of ad units covered in the Creative Guidelines provides general information to help you account for these key factors. 2.2 Ad Units Overview The ad units covered in the Creative Guidelines include ad formats for desktop display and mobile environm ents. Both categories include ad formats for simple, non - rich media ads and ads designed for more complex interactions. Guidance is provided for file weights at three different load stages, animation and video lengths, video formats, mobile considerations, general ad requirements and other unit - specific notes. The ad units are broken down as follows: 2.2.1 Simple ads In general, simple ads are your basic image ads that may include light, 15 - second animati on. While initial file load is close to that of rich media units, file weights are limited to only what is allowed upon initial file load. No subsequent loads, expansion, or video is allowed. A variety of simple ad formats are available in the following ad unit groups:  Universal Ad Package (UAP)  Other Ad Units  Ima ge Ads (mobile) 2.2.2 Rich media ads Ads that require expansion, rich interactions, video, and additional file load weights fall under the selection of ad units defined in the following ad groups:  Display Rising Stars  Rich Media Guidance  Mobile Rising Stars (mobile)  Rich Media/Expand (mobile) Before designing an HTML5 ad, review the Creative Guidelines, check with the ad serving vendor or publisher for additional ad requirements, and consider all the guidance offered in this document so that you can plan for a smooth development process and ultimately a more successful ad experience. © 2016 IAB Technology Laboratory 8 HTML5 for Digital Advertising _v2 3 Developing Your HTML5 Ad Developing in HTML5 requires a different skill set than developing a Flash ad. Flash ads are executed using a plug - in that users install in their browsers . Because of this plug - in, you could generate one file and expect a consistent experience across browsers. With HTML5, you are generating a collection of files with data that browsers interpret directly. Because browsers are all designed differently, HTML 5 ads display differently in each browser. These variations in ad execution require knowledge of the feature set you use to design your ad and plan accordingly for execution in different browsers. Even though your creative development software may generate HTML content, you need to know how browsers handle that content so that you can make adjustments that ensure that ad functions as it’s supposed to. The Creative Guidelines offer a baseline set of file requirements your ad should meet, but this section pro vides more information on how to meet those requirements. 3.1 Working with HTML5 HTML5 Ads use code that a browser or embedded web view (mobile app) processes. A number of software tools that use an integrated development environment (IDE) will allow you to wo rk with a visual interface for producing interactions. You can then use the IDE to generate the HTML5 files needed for ad execution. Visit the IAB HTML5 Wiki for list of HTML5 IDE tools. 3.1.1 The index.html File Within the HTML5 files generated for the ad, there should be one HTML5 document with the file name: index.html. The index fil e precedes all content code with the <!DOCTYPE html> tag. This tag identifies the file as an HTML5 file. Tags to call out the <html> code and <body> content code are also included in the file. While some vendors use a specific naming convention for the nam e of the file that references other files for the ad, “index.html” is the common convention. The more this file name is used as an HTML file name convention for ads, the easier it is for most systems to find the relevant file and execute accordingly. The i ndex.html file naming convention is only necessary in a .zip file that represents a single ad and only in cases where multiple HTML files are included. No recommendations are made for file naming in a package of multiple ads or for an ad file that is conta ined within only one HTML file. 3.1.2 The Code An HTML5 IDE generates code as you develop the ad creative. You should have access to a panel or window that displays the code, and you should be able to adjust this code in order to meet certain ad standards that t he IDE cannot produce. For example, declaring ad dimensions is not something the IDE will do. In the Dimensions section of this document, a recommendation is given for declaring ad dimensions in a standard way that most systems will recognize. Another example includes a standard way to provide",
  "iabRequests": "© 2016 IAB Technology Laboratory 3 HTML5 for Digital Advertising _v2 T ABLE OF C ONTENTS Executive Summary ................................ ................................ ................................ .. 5 Audience ................................ ................................ ................................ ................... 5 1 Overview ................................ ................................ ............................... 6 1.1 Designer’s role vs. ad technologist ................................ ................................ ... 6 2 IAB Display Creative Guidelines ................................ ......................... 6 2.1 Display in Desktop vs. Mobile ................................ ................................ .......... 6 2.2 Ad Units Overview ................................ ................................ ............................ 7 2.2.1 Simple ads ................................ ................................ ................................ ...................... 7 2.2.2 Rich media ads ................................ ................................ ................................ ............... 7 3 Developing Your HTML5 Ad ................................ ................................ 8 3.1 Working with HTML5 ................................ ................................ ........................ 8 3.1.1 The index.html File ................................ ................................ ................................ ......... 8 3.1.2 The Code ................................ ................................ ................................ ........................ 8 3.2 Dimensions ................................ ................................ ................................ ...... 9 3.3 Expanding ads ................................ ................................ ................................ . 9 3.4 Text and Fonts ................................ ................................ ................................ . 9 3.4.1 Webfont support and availability ................................ ................................ .................. 10 3.4.2 Font usage considerations ................................ ................................ ........................... 10 3.4.3 Licensing Considerations ................................ ................................ ............................. 11 3.5 Backup Image ................................ ................................ ................................ 11 3.5.1 HTML5 Fallback Recommendations: ................................ ................................ ........... 11 3.6 Labeling ................................ ................................ ................................ .......... 12 3.7 Animation ................................ ................................ ................................ ....... 12 3.7.1 CSS ................................ ................................ ................................ .............................. 12 3.7.2 JavaScript ................................ ................................ ................................ ..................... 13 3.7.3 Weighing the Options for HTML5 Development ................................ ........................... 13 3.7.4 Performance ................................ ................................ ................................ ................. 13 3.7.5 Compatibility ................................ ................................ ................................ ................. 14 3.7.6 Flexibility ................................ ................................ ................................ ....................... 14 3.7.7 Workflow ................................ ................................ ................................ ....................... 14 3.8 Animation Rendering Technologies ................................ ................................ 15 3.9 Recommendation ................................ ................................ ........................... 15 3.10 Interactions ................................ ................................ ................................ ... 16 3.10.1 The Clickthrough ................................ ................................ ................................ ........ 16 3.10.2 Mobile Rich Interactions ................................ ................................ ............................. 17 3.10.3 Display Rich Interactions ................................ ................................ ............................ 17 © 2016 IAB Technology Laboratory 4 HTML5 for Digital Advertising _v2 3.11 Video ................................ ................................ ................................ ............ 18 3.11.1 Display Video vs. In - Stream Video ................................ ................................ ............. 18 3.11.2 File Format and Video Codecs ................................ ................................ ................... 18 3.11.3 Aspect Ratios ................................ ................................ ................................ ............. 19 3.11.4 HD versus SD ................................ ................................ ................................ ............. 19 3.11.5 Compression and file preparation tips ................................ ................................ ........ 19 3.11.6 Progressive vs Adaptive Streaming ................................ ................................ ........... 19 3.12 Audio ................................ ................................ ................................ ............ 20 3.13 Controls ................................ ................................ ................................ ........ 20 3.13.1 Autoplay ................................ ................................ ................................ ...................... 20 4 Packaging and Testing Your HTML5 Ad ................................ .......... 20 4.1 File size and file load ................................ ................................ ...................... 21 4.1.1 Asset Compression ................................ ................................ ................................ ...... 21 4.1.2 Shared Libraries ................................ ................................ ................................ ........... 21 4.1.3 Zip File Contents ................................ ................................ ................................ .......... 22 4.1.4 File requests ................................ ................................ ................................ ................. 23 4.2 CPU and GPU usage ................................ ................................ ..................... 23 5 Tools ................................ ................................ ................................ ... 24 5.1 For Designers ................................ ................................ ................................ . 24 5.1.1 HTML5 mobile rich media ................................ ................................ ............................. 24 5.1.2 Graphic Development Tools ................................ ................................ ......................... 24 5.1.3 HTML5 Animation Tools ................................ ................................ ............................... 24 5.1.4 Flash converters ................................ ................................ ................................ ........... 25 5.1.5 HTML5 website tools ................................ ................................ ................................ .... 25 5.2 For Developers (Ad Technologists) ................................ ................................ 25 5.2.1 Browser Reference ................................ ................................ ................................ ....... 25 5.2.2 JavaScript Libraries ................................ ................................ ................................ ...... 26 5.2.3 Code compression ................................ ................................ ................................ ........ 26 5.2.4 Image compression ................................ ................................ ................................ ...... 26 5.2.5 Sprite Generators ................................ ................................ ................................ ......... 26 5.2.6 Web fonts technology ................................ ................................ ................................ ... 26 6 Terminology ................................ ................................ ....................... 27 © 2016 IAB Technology Laboratory 5 HTML5 for Digital Advertising _v2 Executive Summary HTML5 for Digital Advertising is a guide to help ad developers produce ads in an HTML5 format that meet IAB creative guidelines for desktop and mobile display ads. Historically, ad developers have used Adobe Flash™ tools to create an interactive ad experience online. Flash allowed developers to create animated ads with interactive elements without having to worry too much about code. These ads required a browser plug - in to execute Flash ads. However, in recent years, many browsers have announced reducing support for Flash content to some degree or another. Some browsers are discontinuing support altogether. In addition, some a d networks have announced discontinuation of Flash Ads timelines. This increasing lack of support for Flash - formatted ads and the release of HTML5 in late 2012 has prompted the digital advertising industry to look at working with HTML5 as a replacement technology for Flash. However, ad developers who are use d to working with Flash visual development tools find moving to the more code - heavy HTML5 format a daunting transition. In addition, the overhead in ad operations is overwhelming as ad technologists work with ad developers to format HTML5 ads to meet publisher requirements. While working with HTML5 is complex, it’s not necessarily more complex than working with Adobe Creative Cloud (Flash and other Adobe animation tools). In fact, a number of visual development tools have been released in recent years to produce interactive content in an HTML5 format without having to deal much with the code. Despite the options available for ad developers, working with HTML5 is different than working with the traditional animation tools that use Flash plug - ins fo r execution . This document provides guidance on ad development in HTML5, including tips for generating, packaging, and testing ads as well as how to work with ad operations to ensure ads will load and work as expected in a live campaign. Seamless operation with HTML5 ads continues to prove challenging, but adhering to the practices outlined in the document will improve ad development and reduce ad operation overhead. Audience This document is designed for ad designers, but other parties in the ad supply cha in, especially those who manage file uploads and ad trafficking, may benefit from reviewing the guidance provided.",
  "creativeBorder": "© 2016 IAB Technology Laboratory 11 HTML5 for Digital Advertising _v2 server - side supported fonts must still be included in the overall file weight of the ad, the hosted fonts allow for l ong - term browser caching, which improves the ad load time by reducing the size of transferred data and the number of file requests needed to deliver repeat ad impressions.  Shared web font resources: Using static locations, such as with a vendor or partner that hosts web fonts, allows for long - term browser caching, reducing both the data transfer size and the number of HTTP requests. Shared web fonts also allows for font use among different ad units. When hosted on a shared server but cached locally, fonts remain available without requiring any additional data transfer or load requests, which also eliminates FOUT effect on subsequent ad impressions. If you’re not sure how to best support the fonts used in your ad, check with your ad server or publisher rega rding your options. 3.4.3 Licensing Considerations Fonts come with a EULA that specifies how and where the font can be used. Many font foundries provide licenses and font formats specifically for distribution on the web. Be mindful of the terms defined by the EU LA, as there can be requirements and limitations on embedding, view count, number of domains hosted, and other considerations which may not be appropriate for the conditions of the ad publisher. Contact the providing font foundry to learn more about the re quirements and terms for the font to be included in your ad creative. 3.5 Backup Image In HTML5, compatibility depends on which tags the ad uses and whether the browser supports each of those tags. Since HTML5 is specification defined by the W3C, browsers can choose which parts of the specification they implement, without any particular order or priority. In short, whether a browser supports “HTML5” or not is undefined and ad servers are not designed to detect HTML5 compatibility in browsers. Ads can, however, check for feature support. Visit the IAB HTML5 wiki for a list of resources that can be used to check feature compatibility in different browsers. 3.5.1 HTML5 Fallback Rec ommendations: Fallback functionality is a technique that implements alternate functionality when certain HTML5 features are not supported. Fallback preparation should include testing ad features across browsers to ensure acceptable rendering as well as sta tic images when required by publishers. © 2016 IAB Technology Laboratory 12 HTML5 for Digital Advertising _v2 The following recommendations help ensure HTML5 ads work as designed:  Note HTML5 features used . Depending on the API usage, an ad can be compatible with all existing browsers or only a certain subset. There are s everal tools available to help show which browsers support which features, many of which may be available in the animation software used. For more information, see the IAB HTML5 Wiki . To determine which features your ad uses, review HTML5 development tool specifications. For example, for animation, the software may output the result in CSS, JavaScript or Canvas. Each of these outputs have certain pros and cons.  “Graceful degradation” is highly recommended . The lack of one feature or another in a browser does not mean the ad is incompatible. For example, if getting the geo location is not available in the browser, the ad can provide a field for typing in the zip c ode or city name. Libraries such as Modernizr help with browser feature detection at run - time.  <noscript> Tag should be applied, this provides a path to an alternate image when users have scripts disabled in their b rowser, or don’t support client - side scripting. Ad designers may be challenged as they design fallback functionality for each HTML5 feature used, but the effort involved defines the consumer experience and therefore the effectiveness of the ad. 3.6 Labeling Since the webpage content and HTML5 ad share the same rendering technology (the browser) and resources, the ad unit must be clearly distinguishable from the normal webpage content as per the IAB Display Advertising Guidelines . To protect the aesthetics of the banner and brand message, a border should be applied in the ad creative rather than impose upon the ad server to produce a border. 3.7 Animation In general, there are two ways to animate HTML5 banners: using CSS or JavaScript . Each has its strengths and weaknesses. When selecting a tool to generate your ads, understanding which technologies it uses to construct and animate your ads is essential for maximizing compatibility and performance. 3.7.1 CSS CSS offers “transitions” and “animations” that can be applied directly in style sheets (e.g. “#element { transition: all 2s; }”). Instead of manually applying values on each frame like you would in JavaScript , CSS defines rules that th e browser will implement to render the animation. Their native nature is both a strength and a weakness: it means that performance is usually great but it also means that browser implementation quirks are much more difficult (or impossible) to work around. The browser can also do smart optimizations, like ignore rendering the animation when it’s not visible. © 2016 IAB Technology Laboratory 13 HTML5 for Digital Advertising _v2 3.7.2 JavaScript Animation is achieved with JavaScript by changing property values many times per second, typically in a requestAnimationFrame loop. The most commonly animated properties are CSS styles which can be set using JavaScript (e.g. element.style.width = “100px”). JavaScript can also be used to animate <canvas> content, WebGL, scroll position, SVG attributes, and almost anything in the browser. JavaSc ript delivers maximum flexibility and compatibility. It is capable of stellar performance, but it is also more performance - sensitive; poorly - written JavaScript can have a much bigger impact on performance than poorly - written CSS animation. For tips on leve raging better JavaScript for animation, visit the wiki . 3.7.3 Weighing the Options for HTML5 Development Developing an ad using HTML5 is a lot like developing a webpage. The process can involve hand - coding or using tools that leverage HTML5 technologies such as JavaScript and CSS. There are four factors to consider when assessing which technology to use for developing your HTML5 ads:  Performance  Compatibility  Flexibility  Workflow/Ease - of - use Let’s look at CSS and JavaScript in light of these four factors. 3.7.4 Performance Well - written JavaScript animation and CSS animation both perform pretty well, but JavaScript animation is sensitive to the quality of code used to generate th e animation. The software - generated code is often poorly written, but unless you’re an expert coder, you’ll have to work with automated JavaScript that is likely to under perform. JavaScript also requires more code because of the libraries needed to suppo rt execution. However, some tools use commonly shared libraries that most ad networks host on their CDNs. If you can make use of these shared libraries, then you may be able to have them exempted from your ad’s file size. When this is the case, performance falls in favor of JavaScript because the ad - specific code that references a shared library can more concisely define the animation than CSS can. JavaScript can also use more CPU than CSS - animations if there are multiple JavaScript - animations on the same p age. See the HTML5 wiki for a list of commonly shared JavaScript libraries.",
  "httpsOnly": "© 2016 IAB Technology Laboratory 17 HTML5 for Digital Advertising _v2 In HTML, this variable should always be in the <head> tag as in the following example: <!DOCTYPE html> <html> <head> <meta charset=\"UTF - 8\"> <title></title> <script type=\"text/javascript\"> var clickTag = \" \"; </script> </head> In iframe cases where the clickthrough is included in the iframe src tag, us e the variable as follows: <iframe src=\"http://d2o307dm5mqftz.cloudfront.net/1539675001/1445477600222/ a.html? clickTag =$$MACRO$$\"></iframe> Using the variable clickTag and including a function designed to set the click URL to this variable reduces a lot of overhead when it comes to setting the clickthrough in HTML ads. The content of click T ag can vary from being a combination of landing page URL, Tracking URL, Ad server Macro etc. No specific recommendation on the content of the clickTag is provided except that all of them should be inside of the click tag variable. As always, check with your partners regarding the best way to implement the clickthrough or any other inte ractions that will be tracked. 3.10.2 Mobile Rich Interactions Rich ads with functions that leverage mobile in - app features, like geo - location and tilt, should leverage the IAB Mobile Rich Media Ad Interface Definition (MRAID). MRAID offers an API that enables yo ur ad to interact with MRAID - compliant mobile apps. Using MRAID involves building standard calls and functions into the ad so that MRAID - compliant apps can recognize them and respond accordingly. This communication not only enables rich user interactions i n mobile devices, it also enables standardized tracking used to track campaign and ad performance. For more information on MRAID, please visit http://www.iab.com/guidelines/mobile - rich - media - ad - interface - definitions - mraid/ . 3.10.3 Display Rich Interactions Rich m edia interactions in display advertising require the browser to execute code on the page. Publishers have a rigid certification process for ad vendors who can serve ad code to their pages because it introduces a security risk. Because of this risk, many ad s are served into an iframe, a mini webpage that is isolated from other page content. While more secure, iframes prohibit any ad - browser interactions, and ultimately any rich user experience that involve ad expansion and other user - initiated interactions. The IAB developed SafeFrame to enable browser - ad interactions using an API that allows for communication between the page and the iframe. Like MRAID, SafeFrame involves building in standard calls and functions that a webpage can recognize and respond accor dingly. Despite © 2016 IAB Technology Laboratory 18 HTML5 for Digital Advertising _v2 the benefits of SafeFrame, publisher implementation is complex and adoption has been slow. However some publishers support SafeFrame. If you’re developing a rich media ad for display with concerns about whether the ad will function properly , check with your partners about any special requirements for designing user - interaction features. More details on SafeF rame are available here http://www.iab.com/guidelines/safeframe/ and http://safeframes.net/ and https://github.com/InteractiveAdvertisingBureau/safeframe . 3.11 Video The following sections establish a set of guidelines for HTML5 creative that make use of the video tag so that creative designe rs can produce ads with video that function correctly across multiple browsers. 3.11.1 Display Video vs. In - Stream Video Display video is video that is served into a display ad space, either as part of a banner ad or on its own. Several ad formats that use video are included in the display video definition. Display video includes but is not limited to the following formats:  In - banner video  In - page video  Rich media  Interstitial  Incentivized video This document addresses these forms of display video. In - stream vide o requires different resources and technology and is not covered in this document. Ads served in - stream are served to a player or app before, during, or after some form of streaming content. Guidelines for formatting ads for digital video in - stream ads are provided in the IAB Digital Video In - Stream Ad Format Guidelines. 3.11.2 File Format and Video Codecs For an HTML5 video ad to play correctly in most browsers, you may need a few different file formats. While MP4 and WebM formats are typically sufficient for mos t browsers, some additional formats may be necessary for support in certain browsers. A few common formats and codecs are:  MPEG - 4(MP4)/H.264 with AAC audio. Use the H.264 Base profile to ensure smooth working on lower end devices.  Ogg/Theora with Vorbis a udio.  WebM/Vp8 with Vorbis audio. Check the IAB wiki for resources that provide information on browser support. © 2016 IAB Technology Laboratory 19 HTML5 for Digital Advertising _v2 These video files can be included in the HTML for the creative using the <video> tag. The browser uses the first recognized file format. Note the file weight of the video. The file weight used contributes to the overall ad file size and is subject to the Creative Guidelines limits. The following code sample i ncludes the suggested files using the HTML5 <video> tag: <video width=\"320\" height=\"240\" controls> <source src=\"pr6.mp4\" type=\"video/mp4; codecs=avc1.42E01E,mp4a.40.2\"> <source src=\"pr6.webm\" type=\"video/webm; codecs=vp8,vorbis\"> <source src=\"pr6.og v\" type=\"video/ogg; codecs=theora,vorbis\"> </video> 3.11.3 Aspect Ratios For ad campaigns targeted to mobile devices or in the case of expanding rich media, the preferred aspect ratio for video is 16:9. For in - banner videos, an aspect ratio of 4:3 is commonly accepted. Commonly accepted video dimensions for in - banner video inc lude:  300x600 (large banner)  300x250 (medium rectangle)  300x170 (small rectangle)  728x90 (cropped to display main content) 3.11.4 HD versus SD Standard definition (SD) may be used for display in low - res phones and small devices with resolution up to 960x640 px. High definition (HD) video may be used for Retina screens and devices with resolution up to 1024x769 px. Most in - banner video ads don’t display on big screens, but if your campaign includes them as part of their strategy, ultra - high definition video may be generated for serving to devices with resolutions of 2048x1536 px or more. 3.11.5 Compression and file preparation tips Provide a version of the video in which you reduce the audio to mono that can serve to devices that don’t support stereo. Also, if the video c ontains no audio, be sure to generate the video without an audio track. Also, use a “web - optimized” format for compression, which moves the movie (MOOV) atom to the beginning. This setting ensures that the video plays as it downloads. Video is often encod ed without adjusting the MOOV atom, and if it’s listed last the browser waits for complete download before playing the video. 3.11.6 Progressive vs Adaptive Streaming By default HTML5 supports progressive video download, which means the browser downloads the vide o like an image or any other page resource, instead of playing it from where it’s served (streaming). Adaptive bitrate streaming methods have been developed to simulate streaming video, which improves performance and smooth playback.",
  "externalResources": "© 2016 IAB Technology Laboratory 9 HTML5 for Digital Advertising _v2 multiple video files in ads that use video. Wherever relevant, this document provides sample HTML code when you need to inspect or adjust the generated code. 3.2 Dimensions One of the powerful characteristics of HTML5 is how easy it is to gener ate ads that adjust to the container size dynamically, similar to a web - page viewed on browsers of different window sizes. However, in most cases the ad dimensions should match the placement dimensions. When the HTML ad content is contained within an HTML <head> tag, you can define ad dimensions by adding a <meta> tag named “ad.size” within the HTML <head> tag as in the example below: <meta name=\"ad.size” content=”width=300,height=250”> If the width and height are left undefined, the publisher may either disregard the ad or consider the creative to be responsive in size and react according to its policy on responsive ad sizes. Check with the ad server or publisher on their policy for ad unit dimensions. 3.3 Expanding ads Expanding ads involve some extra techni cal effort to display. When an ad serves to a web page, it is often served into an iframe (an html window within the page). Within the iframe, ad functionality is limited, and the communication to the webpage that is required to make an expanding ad work i s blocked. Expanding ads and other ads that involve complex interactions must work around this iframe limitation. In most cases, the ad serving vendor you work with provides a platform and possibly a template that handles the expansion operation. For exam ple, in some cases you may provide two creative: the collapsed version and the expanded version. You would then upload those two versions and the ad server would handle the expansion. However, each vendor may handle this operation differently. Check in wit h your ad serving technology vendor about how to design an expanding ad that works with their setup. 3.4 Text and Fonts Text content can be presented as part of the creative in different ways, using either text and fonts, by encapsulating text as part of a sca lable vector graphic (SVG), or in rasterized images. With advances in CSS and widespread adoption of webfonts, representing text content using HTML5 text elements and webfonts, provides the most flexible option. Some of benefits of using text include:  Impr oved legibility and readability of text displayed on devices with various screen sizes and resolutions  Reduced ad unit weight - the text element accompanied by a small web font (or one using a device font or a cached font resource) would be universally sca lable using less bandwidth than a set of images  Guaranteed accessibility of the ad content (e.g. when using screen readers)  Guaranteed text look and feel preserving a brand identity of advertised products and services © 2016 IAB Technology Laboratory 10 HTML5 for Digital Advertising _v2  Preserving text and content layout  En abling dynamic content updates and personalization  Giving content authors greater typographic controls and language choices outside of what’s available with default system fonts;  Sharing web font resources among multiple ad units, and  Using automatic brows er caching of font resources thereby lowering the ad unit load times and improving end - user experience by reducing ad unit weights and the number of HTTP requests. 3.4.1 Webfont support and availability Webfonts are supported using the Web Open Font Format (WOFF ) or (in IE) Embedded OpenType (EOT). These standards are file formats for supplying font rendering details for your ad’s text. WOFF is supported in 2 versions, 1.0 and 2.0. WOFF 2.0 is gaining adoption, but until it is more universally supported (and unti l old browsers such as IE are phased out), the CSS@font - face declarations should include font formats for all three versions:  WOFF 2.0  WOFF 1.0  EOT (if support for legacy IE clients is desired) Fonts represent an additional file in your ad package and contribute to overall file weight. While inclusion of all three formats listed is recommended for compatibility on all browsers, only one web font file is downloaded. The added file weight for inclu ding these three formats is based on the average file size of the three formats, since only one is downloaded. Publishers are encouraged to use shared font libraries and exempt any file weight that would otherwise be added for included webfonts. 3.4.2 Font usage considerations For all the benefits that webfonts offer, a few details to ensure proper font rendering should be considered:  Font substitutes: If a font is not supported or is otherwise missing during ad load and display, a fallback font substitute is used. To avoid skewing the ad appearance, declare suitable font substitutes the browser can use instead of allowing the browser to select a default font substitute. Fallback font definitions play an important role in minimizing the \"Flash Of Unstyled Text\" (FOUT) effect.  Font subsetting: Browsers may use a “fallback” font to render the text visible while the requested webfont is being loaded. Depending on the size of the webfont and connection bandwidth, this proce ss causes a brief “flash of unstyled text” or FOUT. To minimize the FOUT effect in ad units with static text content, you can subset the web font to reduce the glyph set of a font to only include those glyphs that are used in the creative. For really small size font subsets you may also consider using data URI for inline font data embedding. While this option increases CSS file size, it eliminates the file request for the font, improves load time, and avoids the FOUT effect.  Server - side support: The fonts u sed by your ad unit(s) may be hosted online by third party servers (such as ad servers and publishers or webfont service providers). While © 2016 IAB Technology Laboratory 11 HTML5 for Digital Advertising _v2 server - side supported fonts must still be included in the overall file weight of the ad, the hosted fonts allow for l ong - term browser caching, which improves the ad load time by reducing the size of transferred data and the number of file requests needed to deliver repeat ad impressions.  Shared web font resources: Using static locations, such as with a vendor or partner that hosts web fonts, allows for long - term browser caching, reducing both the data transfer size and the number of HTTP requests. Shared web fonts also allows for font use among different ad units. When hosted on a shared server but cached locally, fonts remain available without requiring any additional data transfer or load requests, which also eliminates FOUT effect on subsequent ad impressions. If you’re not sure how to best support the fonts used in your ad, check with your ad server or publisher rega rding your options. 3.4.3 Licensing Considerations Fonts come with a EULA that specifies how and where the font can be used. Many font foundries provide licenses and font formats specifically for distribution on the web. Be mindful of the terms defined by the EU LA, as there can be requirements and limitations on embedding, view count, number of domains hosted, and other considerations which may not be appropriate for the conditions of the ad publisher. Contact the providing font foundry to learn more about the re quirements and terms for the font to be included in your ad creative. 3.5 Backup Image In HTML5, compatibility depends on which tags the ad uses and whether the browser supports each of those tags. Since HTML5 is specification defined by the W3C, browsers can choose which parts of the specification they implement, without any particular order or priority. In short, whether a browser supports “HTML5” or not is undefined and ad servers are not designed to detect HTML5 compatibility in browsers. Ads can, however, check for feature support. Visit the IAB HTML5 wiki for a list of resources that can be used to check feature compatibility in different browsers. 3.5.1 HTML5 Fallback Rec ommendations: Fallback functionality is a technique that implements alternate functionality when certain HTML5 features are not supported. Fallback preparation should include testing ad features across browsers to ensure acceptable rendering as well as sta tic images when required by publishers.",
  "video": "© 2016 IAB Technology Laboratory 3 HTML5 for Digital Advertising _v2 T ABLE OF C ONTENTS Executive Summary ................................ ................................ ................................ .. 5 Audience ................................ ................................ ................................ ................... 5 1 Overview ................................ ................................ ............................... 6 1.1 Designer’s role vs. ad technologist ................................ ................................ ... 6 2 IAB Display Creative Guidelines ................................ ......................... 6 2.1 Display in Desktop vs. Mobile ................................ ................................ .......... 6 2.2 Ad Units Overview ................................ ................................ ............................ 7 2.2.1 Simple ads ................................ ................................ ................................ ...................... 7 2.2.2 Rich media ads ................................ ................................ ................................ ............... 7 3 Developing Your HTML5 Ad ................................ ................................ 8 3.1 Working with HTML5 ................................ ................................ ........................ 8 3.1.1 The index.html File ................................ ................................ ................................ ......... 8 3.1.2 The Code ................................ ................................ ................................ ........................ 8 3.2 Dimensions ................................ ................................ ................................ ...... 9 3.3 Expanding ads ................................ ................................ ................................ . 9 3.4 Text and Fonts ................................ ................................ ................................ . 9 3.4.1 Webfont support and availability ................................ ................................ .................. 10 3.4.2 Font usage considerations ................................ ................................ ........................... 10 3.4.3 Licensing Considerations ................................ ................................ ............................. 11 3.5 Backup Image ................................ ................................ ................................ 11 3.5.1 HTML5 Fallback Recommendations: ................................ ................................ ........... 11 3.6 Labeling ................................ ................................ ................................ .......... 12 3.7 Animation ................................ ................................ ................................ ....... 12 3.7.1 CSS ................................ ................................ ................................ .............................. 12 3.7.2 JavaScript ................................ ................................ ................................ ..................... 13 3.7.3 Weighing the Options for HTML5 Development ................................ ........................... 13 3.7.4 Performance ................................ ................................ ................................ ................. 13 3.7.5 Compatibility ................................ ................................ ................................ ................. 14 3.7.6 Flexibility ................................ ................................ ................................ ....................... 14 3.7.7 Workflow ................................ ................................ ................................ ....................... 14 3.8 Animation Rendering Technologies ................................ ................................ 15 3.9 Recommendation ................................ ................................ ........................... 15 3.10 Interactions ................................ ................................ ................................ ... 16 3.10.1 The Clickthrough ................................ ................................ ................................ ........ 16 3.10.2 Mobile Rich Interactions ................................ ................................ ............................. 17 3.10.3 Display Rich Interactions ................................ ................................ ............................ 17 © 2016 IAB Technology Laboratory 4 HTML5 for Digital Advertising _v2 3.11 Video ................................ ................................ ................................ ............ 18 3.11.1 Display Video vs. In - Stream Video ................................ ................................ ............. 18 3.11.2 File Format and Video Codecs ................................ ................................ ................... 18 3.11.3 Aspect Ratios ................................ ................................ ................................ ............. 19 3.11.4 HD versus SD ................................ ................................ ................................ ............. 19 3.11.5 Compression and file preparation tips ................................ ................................ ........ 19 3.11.6 Progressive vs Adaptive Streaming ................................ ................................ ........... 19 3.12 Audio ................................ ................................ ................................ ............ 20 3.13 Controls ................................ ................................ ................................ ........ 20 3.13.1 Autoplay ................................ ................................ ................................ ...................... 20 4 Packaging and Testing Your HTML5 Ad ................................ .......... 20 4.1 File size and file load ................................ ................................ ...................... 21 4.1.1 Asset Compression ................................ ................................ ................................ ...... 21 4.1.2 Shared Libraries ................................ ................................ ................................ ........... 21 4.1.3 Zip File Contents ................................ ................................ ................................ .......... 22 4.1.4 File requests ................................ ................................ ................................ ................. 23 4.2 CPU and GPU usage ................................ ................................ ..................... 23 5 Tools ................................ ................................ ................................ ... 24 5.1 For Designers ................................ ................................ ................................ . 24 5.1.1 HTML5 mobile rich media ................................ ................................ ............................. 24 5.1.2 Graphic Development Tools ................................ ................................ ......................... 24 5.1.3 HTML5 Animation Tools ................................ ................................ ............................... 24 5.1.4 Flash converters ................................ ................................ ................................ ........... 25 5.1.5 HTML5 website tools ................................ ................................ ................................ .... 25 5.2 For Developers (Ad Technologists) ................................ ................................ 25 5.2.1 Browser Reference ................................ ................................ ................................ ....... 25 5.2.2 JavaScript Libraries ................................ ................................ ................................ ...... 26 5.2.3 Code compression ................................ ................................ ................................ ........ 26 5.2.4 Image compression ................................ ................................ ................................ ...... 26 5.2.5 Sprite Generators ................................ ................................ ................................ ......... 26 5.2.6 Web fonts technology ................................ ................................ ................................ ... 26 6 Terminology ................................ ................................ ....................... 27 © 2016 IAB Technology Laboratory 5 HTML5 for Digital Advertising _v2 Executive Summary HTML5 for Digital Advertising is a guide to help ad developers produce ads in an HTML5 format that meet IAB creative guidelines for desktop and mobile display ads. Historically, ad developers have used Adobe Flash™ tools to create an interactive ad experience online. Flash allowed developers to create animated ads with interactive elements without having to worry too much about code. These ads required a browser plug - in to execute Flash ads. However, in recent years, many browsers have announced reducing support for Flash content to some degree or another. Some browsers are discontinuing support altogether. In addition, some a d networks have announced discontinuation of Flash Ads timelines. This increasing lack of support for Flash - formatted ads and the release of HTML5 in late 2012 has prompted the digital advertising industry to look at working with HTML5 as a replacement technology for Flash. However, ad developers who are use d to working with Flash visual development tools find moving to the more code - heavy HTML5 format a daunting transition. In addition, the overhead in ad operations is overwhelming as ad technologists work with ad developers to format HTML5 ads to meet publisher requirements. While working with HTML5 is complex, it’s not necessarily more complex than working with Adobe Creative Cloud (Flash and other Adobe animation tools). In fact, a number of visual development tools have been released in recent years to produce interactive content in an HTML5 format without having to deal much with the code. Despite the options available for ad developers, working with HTML5 is different than working with the traditional animation tools that use Flash plug - ins fo r execution . This document provides guidance on ad development in HTML5, including tips for generating, packaging, and testing ads as well as how to work with ad operations to ensure ads will load and work as expected in a live campaign. Seamless operation with HTML5 ads continues to prove challenging, but adhering to the practices outlined in the document will improve ad development and reduce ad operation overhead. Audience This document is designed for ad designers, but other parties in the ad supply cha in, especially those who manage file uploads and ad trafficking, may benefit from reviewing the guidance provided.",
  "iframes": "© 2016 IAB Technology Laboratory 8 HTML5 for Digital Advertising _v2 3 Developing Your HTML5 Ad Developing in HTML5 requires a different skill set than developing a Flash ad. Flash ads are executed using a plug - in that users install in their browsers . Because of this plug - in, you could generate one file and expect a consistent experience across browsers. With HTML5, you are generating a collection of files with data that browsers interpret directly. Because browsers are all designed differently, HTML 5 ads display differently in each browser. These variations in ad execution require knowledge of the feature set you use to design your ad and plan accordingly for execution in different browsers. Even though your creative development software may generate HTML content, you need to know how browsers handle that content so that you can make adjustments that ensure that ad functions as it’s supposed to. The Creative Guidelines offer a baseline set of file requirements your ad should meet, but this section pro vides more information on how to meet those requirements. 3.1 Working with HTML5 HTML5 Ads use code that a browser or embedded web view (mobile app) processes. A number of software tools that use an integrated development environment (IDE) will allow you to wo rk with a visual interface for producing interactions. You can then use the IDE to generate the HTML5 files needed for ad execution. Visit the IAB HTML5 Wiki for list of HTML5 IDE tools. 3.1.1 The index.html File Within the HTML5 files generated for the ad, there should be one HTML5 document with the file name: index.html. The index fil e precedes all content code with the <!DOCTYPE html> tag. This tag identifies the file as an HTML5 file. Tags to call out the <html> code and <body> content code are also included in the file. While some vendors use a specific naming convention for the nam e of the file that references other files for the ad, “index.html” is the common convention. The more this file name is used as an HTML file name convention for ads, the easier it is for most systems to find the relevant file and execute accordingly. The i ndex.html file naming convention is only necessary in a .zip file that represents a single ad and only in cases where multiple HTML files are included. No recommendations are made for file naming in a package of multiple ads or for an ad file that is conta ined within only one HTML file. 3.1.2 The Code An HTML5 IDE generates code as you develop the ad creative. You should have access to a panel or window that displays the code, and you should be able to adjust this code in order to meet certain ad standards that t he IDE cannot produce. For example, declaring ad dimensions is not something the IDE will do. In the Dimensions section of this document, a recommendation is given for declaring ad dimensions in a standard way that most systems will recognize. Another example includes a standard way to provide © 2016 IAB Technology Laboratory 9 HTML5 for Digital Advertising _v2 multiple video files in ads that use video. Wherever relevant, this document provides sample HTML code when you need to inspect or adjust the generated code. 3.2 Dimensions One of the powerful characteristics of HTML5 is how easy it is to gener ate ads that adjust to the container size dynamically, similar to a web - page viewed on browsers of different window sizes. However, in most cases the ad dimensions should match the placement dimensions. When the HTML ad content is contained within an HTML <head> tag, you can define ad dimensions by adding a <meta> tag named “ad.size” within the HTML <head> tag as in the example below: <meta name=\"ad.size” content=”width=300,height=250”> If the width and height are left undefined, the publisher may either disregard the ad or consider the creative to be responsive in size and react according to its policy on responsive ad sizes. Check with the ad server or publisher on their policy for ad unit dimensions. 3.3 Expanding ads Expanding ads involve some extra techni cal effort to display. When an ad serves to a web page, it is often served into an iframe (an html window within the page). Within the iframe, ad functionality is limited, and the communication to the webpage that is required to make an expanding ad work i s blocked. Expanding ads and other ads that involve complex interactions must work around this iframe limitation. In most cases, the ad serving vendor you work with provides a platform and possibly a template that handles the expansion operation. For exam ple, in some cases you may provide two creative: the collapsed version and the expanded version. You would then upload those two versions and the ad server would handle the expansion. However, each vendor may handle this operation differently. Check in wit h your ad serving technology vendor about how to design an expanding ad that works with their setup. 3.4 Text and Fonts Text content can be presented as part of the creative in different ways, using either text and fonts, by encapsulating text as part of a sca lable vector graphic (SVG), or in rasterized images. With advances in CSS and widespread adoption of webfonts, representing text content using HTML5 text elements and webfonts, provides the most flexible option. Some of benefits of using text include:  Impr oved legibility and readability of text displayed on devices with various screen sizes and resolutions  Reduced ad unit weight - the text element accompanied by a small web font (or one using a device font or a cached font resource) would be universally sca lable using less bandwidth than a set of images  Guaranteed accessibility of the ad content (e.g. when using screen readers)  Guaranteed text look and feel preserving a brand identity of advertised products and services © 2016 IAB Technology Laboratory 10 HTML5 for Digital Advertising _v2  Preserving text and content layout  En abling dynamic content updates and personalization  Giving content authors greater typographic controls and language choices outside of what’s available with default system fonts;  Sharing web font resources among multiple ad units, and  Using automatic brows er caching of font resources thereby lowering the ad unit load times and improving end - user experience by reducing ad unit weights and the number of HTTP requests. 3.4.1 Webfont support and availability Webfonts are supported using the Web Open Font Format (WOFF ) or (in IE) Embedded OpenType (EOT). These standards are file formats for supplying font rendering details for your ad’s text. WOFF is supported in 2 versions, 1.0 and 2.0. WOFF 2.0 is gaining adoption, but until it is more universally supported (and unti l old browsers such as IE are phased out), the CSS@font - face declarations should include font formats for all three versions:  WOFF 2.0  WOFF 1.0  EOT (if support for legacy IE clients is desired) Fonts represent an additional file in your ad package and contribute to overall file weight. While inclusion of all three formats listed is recommended for compatibility on all browsers, only one web font file is downloaded. The added file weight for inclu ding these three formats is based on the average file size of the three formats, since only one is downloaded. Publishers are encouraged to use shared font libraries and exempt any file weight that would otherwise be added for included webfonts. 3.4.2 Font usage considerations For all the benefits that webfonts offer, a few details to ensure proper font rendering should be considered:  Font substitutes: If a font is not supported or is otherwise missing during ad load and display, a fallback font substitute is used. To avoid skewing the ad appearance, declare suitable font substitutes the browser can use instead of allowing the browser to select a default font substitute. Fallback font definitions play an important role in minimizing the \"Flash Of Unstyled Text\" (FOUT) effect.  Font subsetting: Browsers may use a “fallback” font to render the text visible while the requested webfont is being loaded. Depending on the size of the webfont and connection bandwidth, this proce ss causes a brief “flash of unstyled text” or FOUT. To minimize the FOUT effect in ad units with static text content, you can subset the web font to reduce the glyph set of a font to only include those glyphs that are used in the creative. For really small size font subsets you may also consider using data URI for inline font data embedding. While this option increases CSS file size, it eliminates the file request for the font, improves load time, and avoids the FOUT effect.  Server - side support: The fonts u sed by your ad unit(s) may be hosted online by third party servers (such as ad servers and publishers or webfont service providers). While",
  "clickTags": "© 2016 IAB Technology Laboratory 2 HTML5 for Digital Advertising _v2 A BOUT THE IAB’ S T ECH L AB AND M OBILE M ARKETING C ENTER OF E XCELLENCE The IAB Tech Lab spearheads the development of innovative and scalable technical standards, creates and maintains a code library to assist in rapid, cost - effective implementation of IAB standards, and establishes test platforms for companies to evaluate the compatibility of their technology solutions with IAB standards, which for almost 20 years have been the foundation for interoperability and profitable growth in the digital advertising supply chain. More details can be found at: http://www.iab.com/organizations/iab - tech - lab/ The IAB Mobile Marketing Center of Excellence, an independently funded and staffed unit inside the IAB, is charged with driving the growth of the mobile marketing, advertising and media marketplace. The Mobile Center devotes resources to market and consumer research, mobile advertising case studies, executive training and education, supply chain standardization, creative showcases and best practice identification in the burgeoning field of mobile media and marketing. Our agenda focuses on building profitable revenue growth for companies engaged in mobile marketing, communications and advertising, and helping publishers, marketers an d agency professionals understand and leverage interactive tools and technologies in order to reach and influence the consumer. More information can be found at: http://www.iab.com/topics/mobile/ http://www.iab.net/mobile_advertising_committee This document is on the IAB website at: http://www.iab.com/HTML 5 http://www.iab.net/HTML5_Digital © 2016 IAB Technology Laboratory 3 HTML5 for Digital Advertising _v2 T ABLE OF C ONTENTS Executive Summary ................................ ................................ ................................ .. 5 Audience ................................ ................................ ................................ ................... 5 1 Overview ................................ ................................ ............................... 6 1.1 Designer’s role vs. ad technologist ................................ ................................ ... 6 2 IAB Display Creative Guidelines ................................ ......................... 6 2.1 Display in Desktop vs. Mobile ................................ ................................ .......... 6 2.2 Ad Units Overview ................................ ................................ ............................ 7 2.2.1 Simple ads ................................ ................................ ................................ ...................... 7 2.2.2 Rich media ads ................................ ................................ ................................ ............... 7 3 Developing Your HTML5 Ad ................................ ................................ 8 3.1 Working with HTML5 ................................ ................................ ........................ 8 3.1.1 The index.html File ................................ ................................ ................................ ......... 8 3.1.2 The Code ................................ ................................ ................................ ........................ 8 3.2 Dimensions ................................ ................................ ................................ ...... 9 3.3 Expanding ads ................................ ................................ ................................ . 9 3.4 Text and Fonts ................................ ................................ ................................ . 9 3.4.1 Webfont support and availability ................................ ................................ .................. 10 3.4.2 Font usage considerations ................................ ................................ ........................... 10 3.4.3 Licensing Considerations ................................ ................................ ............................. 11 3.5 Backup Image ................................ ................................ ................................ 11 3.5.1 HTML5 Fallback Recommendations: ................................ ................................ ........... 11 3.6 Labeling ................................ ................................ ................................ .......... 12 3.7 Animation ................................ ................................ ................................ ....... 12 3.7.1 CSS ................................ ................................ ................................ .............................. 12 3.7.2 JavaScript ................................ ................................ ................................ ..................... 13 3.7.3 Weighing the Options for HTML5 Development ................................ ........................... 13 3.7.4 Performance ................................ ................................ ................................ ................. 13 3.7.5 Compatibility ................................ ................................ ................................ ................. 14 3.7.6 Flexibility ................................ ................................ ................................ ....................... 14 3.7.7 Workflow ................................ ................................ ................................ ....................... 14 3.8 Animation Rendering Technologies ................................ ................................ 15 3.9 Recommendation ................................ ................................ ........................... 15 3.10 Interactions ................................ ................................ ................................ ... 16 3.10.1 The Clickthrough ................................ ................................ ................................ ........ 16 3.10.2 Mobile Rich Interactions ................................ ................................ ............................. 17 3.10.3 Display Rich Interactions ................................ ................................ ............................ 17 © 2016 IAB Technology Laboratory 4 HTML5 for Digital Advertising _v2 3.11 Video ................................ ................................ ................................ ............ 18 3.11.1 Display Video vs. In - Stream Video ................................ ................................ ............. 18 3.11.2 File Format and Video Codecs ................................ ................................ ................... 18 3.11.3 Aspect Ratios ................................ ................................ ................................ ............. 19 3.11.4 HD versus SD ................................ ................................ ................................ ............. 19 3.11.5 Compression and file preparation tips ................................ ................................ ........ 19 3.11.6 Progressive vs Adaptive Streaming ................................ ................................ ........... 19 3.12 Audio ................................ ................................ ................................ ............ 20 3.13 Controls ................................ ................................ ................................ ........ 20 3.13.1 Autoplay ................................ ................................ ................................ ...................... 20 4 Packaging and Testing Your HTML5 Ad ................................ .......... 20 4.1 File size and file load ................................ ................................ ...................... 21 4.1.1 Asset Compression ................................ ................................ ................................ ...... 21 4.1.2 Shared Libraries ................................ ................................ ................................ ........... 21 4.1.3 Zip File Contents ................................ ................................ ................................ .......... 22 4.1.4 File requests ................................ ................................ ................................ ................. 23 4.2 CPU and GPU usage ................................ ................................ ..................... 23 5 Tools ................................ ................................ ................................ ... 24 5.1 For Designers ................................ ................................ ................................ . 24 5.1.1 HTML5 mobile rich media ................................ ................................ ............................. 24 5.1.2 Graphic Development Tools ................................ ................................ ......................... 24 5.1.3 HTML5 Animation Tools ................................ ................................ ............................... 24 5.1.4 Flash converters ................................ ................................ ................................ ........... 25 5.1.5 HTML5 website tools ................................ ................................ ................................ .... 25 5.2 For Developers (Ad Technologists) ................................ ................................ 25 5.2.1 Browser Reference ................................ ................................ ................................ ....... 25 5.2.2 JavaScript Libraries ................................ ................................ ................................ ...... 26 5.2.3 Code compression ................................ ................................ ................................ ........ 26 5.2.4 Image compression ................................ ................................ ................................ ...... 26 5.2.5 Sprite Generators ................................ ................................ ................................ ......... 26 5.2.6 Web fonts technology ................................ ................................ ................................ ... 26 6 Terminology ................................ ................................ ....................... 27",
  "fileTypes": "© 2016 IAB Technology Laboratory 7 HTML5 for Digital Advertising _v2 Connection data rates may be limited with mobile devices, so file weight is an important factor to consider when an ad will display in mobile devices. Even in desktop environments with high data rates, heavy file - weighted ads may delay page load and cause user drop - off. The Creative Guidelines provide file size limits that help balance ad load and page load performance. In desktop display, most ads are executed in a browser. However, in a mobile device, ads may be executed within a native applica tion. In this case, ads developed with rich interaction may need an API like MRAID to be executed. Developing an ad that accounts for screen size, connection data rate, and run - time environment results in an ad that can display almost anywhere. The followi ng overview of ad units covered in the Creative Guidelines provides general information to help you account for these key factors. 2.2 Ad Units Overview The ad units covered in the Creative Guidelines include ad formats for desktop display and mobile environm ents. Both categories include ad formats for simple, non - rich media ads and ads designed for more complex interactions. Guidance is provided for file weights at three different load stages, animation and video lengths, video formats, mobile considerations, general ad requirements and other unit - specific notes. The ad units are broken down as follows: 2.2.1 Simple ads In general, simple ads are your basic image ads that may include light, 15 - second animati on. While initial file load is close to that of rich media units, file weights are limited to only what is allowed upon initial file load. No subsequent loads, expansion, or video is allowed. A variety of simple ad formats are available in the following ad unit groups:  Universal Ad Package (UAP)  Other Ad Units  Ima ge Ads (mobile) 2.2.2 Rich media ads Ads that require expansion, rich interactions, video, and additional file load weights fall under the selection of ad units defined in the following ad groups:  Display Rising Stars  Rich Media Guidance  Mobile Rising Stars (mobile)  Rich Media/Expand (mobile) Before designing an HTML5 ad, review the Creative Guidelines, check with the ad serving vendor or publisher for additional ad requirements, and consider all the guidance offered in this document so that you can plan for a smooth development process and ultimately a more successful ad experience. © 2016 IAB Technology Laboratory 8 HTML5 for Digital Advertising _v2 3 Developing Your HTML5 Ad Developing in HTML5 requires a different skill set than developing a Flash ad. Flash ads are executed using a plug - in that users install in their browsers . Because of this plug - in, you could generate one file and expect a consistent experience across browsers. With HTML5, you are generating a collection of files with data that browsers interpret directly. Because browsers are all designed differently, HTML 5 ads display differently in each browser. These variations in ad execution require knowledge of the feature set you use to design your ad and plan accordingly for execution in different browsers. Even though your creative development software may generate HTML content, you need to know how browsers handle that content so that you can make adjustments that ensure that ad functions as it’s supposed to. The Creative Guidelines offer a baseline set of file requirements your ad should meet, but this section pro vides more information on how to meet those requirements. 3.1 Working with HTML5 HTML5 Ads use code that a browser or embedded web view (mobile app) processes. A number of software tools that use an integrated development environment (IDE) will allow you to wo rk with a visual interface for producing interactions. You can then use the IDE to generate the HTML5 files needed for ad execution. Visit the IAB HTML5 Wiki for list of HTML5 IDE tools. 3.1.1 The index.html File Within the HTML5 files generated for the ad, there should be one HTML5 document with the file name: index.html. The index fil e precedes all content code with the <!DOCTYPE html> tag. This tag identifies the file as an HTML5 file. Tags to call out the <html> code and <body> content code are also included in the file. While some vendors use a specific naming convention for the nam e of the file that references other files for the ad, “index.html” is the common convention. The more this file name is used as an HTML file name convention for ads, the easier it is for most systems to find the relevant file and execute accordingly. The i ndex.html file naming convention is only necessary in a .zip file that represents a single ad and only in cases where multiple HTML files are included. No recommendations are made for file naming in a package of multiple ads or for an ad file that is conta ined within only one HTML file. 3.1.2 The Code An HTML5 IDE generates code as you develop the ad creative. You should have access to a panel or window that displays the code, and you should be able to adjust this code in order to meet certain ad standards that t he IDE cannot produce. For example, declaring ad dimensions is not something the IDE will do. In the Dimensions section of this document, a recommendation is given for declaring ad dimensions in a standard way that most systems will recognize. Another example includes a standard way to provide © 2016 IAB Technology Laboratory 9 HTML5 for Digital Advertising _v2 multiple video files in ads that use video. Wherever relevant, this document provides sample HTML code when you need to inspect or adjust the generated code. 3.2 Dimensions One of the powerful characteristics of HTML5 is how easy it is to gener ate ads that adjust to the container size dynamically, similar to a web - page viewed on browsers of different window sizes. However, in most cases the ad dimensions should match the placement dimensions. When the HTML ad content is contained within an HTML <head> tag, you can define ad dimensions by adding a <meta> tag named “ad.size” within the HTML <head> tag as in the example below: <meta name=\"ad.size” content=”width=300,height=250”> If the width and height are left undefined, the publisher may either disregard the ad or consider the creative to be responsive in size and react according to its policy on responsive ad sizes. Check with the ad server or publisher on their policy for ad unit dimensions. 3.3 Expanding ads Expanding ads involve some extra techni cal effort to display. When an ad serves to a web page, it is often served into an iframe (an html window within the page). Within the iframe, ad functionality is limited, and the communication to the webpage that is required to make an expanding ad work i s blocked. Expanding ads and other ads that involve complex interactions must work around this iframe limitation. In most cases, the ad serving vendor you work with provides a platform and possibly a template that handles the expansion operation. For exam ple, in some cases you may provide two creative: the collapsed version and the expanded version. You would then upload those two versions and the ad server would handle the expansion. However, each vendor may handle this operation differently. Check in wit h your ad serving technology vendor about how to design an expanding ad that works with their setup. 3.4 Text and Fonts Text content can be presented as part of the creative in different ways, using either text and fonts, by encapsulating text as part of a sca lable vector graphic (SVG), or in rasterized images. With advances in CSS and widespread adoption of webfonts, representing text content using HTML5 text elements and webfonts, provides the most flexible option. Some of benefits of using text include:  Impr oved legibility and readability of text displayed on devices with various screen sizes and resolutions  Reduced ad unit weight - the text element accompanied by a small web font (or one using a device font or a cached font resource) would be universally sca lable using less bandwidth than a set of images  Guaranteed accessibility of the ad content (e.g. when using screen readers)  Guaranteed text look and feel preserving a brand identity of advertised products and services",
  "backup": "© 2016 IAB Technology Laboratory 2 HTML5 for Digital Advertising _v2 A BOUT THE IAB’ S T ECH L AB AND M OBILE M ARKETING C ENTER OF E XCELLENCE The IAB Tech Lab spearheads the development of innovative and scalable technical standards, creates and maintains a code library to assist in rapid, cost - effective implementation of IAB standards, and establishes test platforms for companies to evaluate the compatibility of their technology solutions with IAB standards, which for almost 20 years have been the foundation for interoperability and profitable growth in the digital advertising supply chain. More details can be found at: http://www.iab.com/organizations/iab - tech - lab/ The IAB Mobile Marketing Center of Excellence, an independently funded and staffed unit inside the IAB, is charged with driving the growth of the mobile marketing, advertising and media marketplace. The Mobile Center devotes resources to market and consumer research, mobile advertising case studies, executive training and education, supply chain standardization, creative showcases and best practice identification in the burgeoning field of mobile media and marketing. Our agenda focuses on building profitable revenue growth for companies engaged in mobile marketing, communications and advertising, and helping publishers, marketers an d agency professionals understand and leverage interactive tools and technologies in order to reach and influence the consumer. More information can be found at: http://www.iab.com/topics/mobile/ http://www.iab.net/mobile_advertising_committee This document is on the IAB website at: http://www.iab.com/HTML 5 http://www.iab.net/HTML5_Digital © 2016 IAB Technology Laboratory 3 HTML5 for Digital Advertising _v2 T ABLE OF C ONTENTS Executive Summary ................................ ................................ ................................ .. 5 Audience ................................ ................................ ................................ ................... 5 1 Overview ................................ ................................ ............................... 6 1.1 Designer’s role vs. ad technologist ................................ ................................ ... 6 2 IAB Display Creative Guidelines ................................ ......................... 6 2.1 Display in Desktop vs. Mobile ................................ ................................ .......... 6 2.2 Ad Units Overview ................................ ................................ ............................ 7 2.2.1 Simple ads ................................ ................................ ................................ ...................... 7 2.2.2 Rich media ads ................................ ................................ ................................ ............... 7 3 Developing Your HTML5 Ad ................................ ................................ 8 3.1 Working with HTML5 ................................ ................................ ........................ 8 3.1.1 The index.html File ................................ ................................ ................................ ......... 8 3.1.2 The Code ................................ ................................ ................................ ........................ 8 3.2 Dimensions ................................ ................................ ................................ ...... 9 3.3 Expanding ads ................................ ................................ ................................ . 9 3.4 Text and Fonts ................................ ................................ ................................ . 9 3.4.1 Webfont support and availability ................................ ................................ .................. 10 3.4.2 Font usage considerations ................................ ................................ ........................... 10 3.4.3 Licensing Considerations ................................ ................................ ............................. 11 3.5 Backup Image ................................ ................................ ................................ 11 3.5.1 HTML5 Fallback Recommendations: ................................ ................................ ........... 11 3.6 Labeling ................................ ................................ ................................ .......... 12 3.7 Animation ................................ ................................ ................................ ....... 12 3.7.1 CSS ................................ ................................ ................................ .............................. 12 3.7.2 JavaScript ................................ ................................ ................................ ..................... 13 3.7.3 Weighing the Options for HTML5 Development ................................ ........................... 13 3.7.4 Performance ................................ ................................ ................................ ................. 13 3.7.5 Compatibility ................................ ................................ ................................ ................. 14 3.7.6 Flexibility ................................ ................................ ................................ ....................... 14 3.7.7 Workflow ................................ ................................ ................................ ....................... 14 3.8 Animation Rendering Technologies ................................ ................................ 15 3.9 Recommendation ................................ ................................ ........................... 15 3.10 Interactions ................................ ................................ ................................ ... 16 3.10.1 The Clickthrough ................................ ................................ ................................ ........ 16 3.10.2 Mobile Rich Interactions ................................ ................................ ............................. 17 3.10.3 Display Rich Interactions ................................ ................................ ............................ 17 © 2016 IAB Technology Laboratory 4 HTML5 for Digital Advertising _v2 3.11 Video ................................ ................................ ................................ ............ 18 3.11.1 Display Video vs. In - Stream Video ................................ ................................ ............. 18 3.11.2 File Format and Video Codecs ................................ ................................ ................... 18 3.11.3 Aspect Ratios ................................ ................................ ................................ ............. 19 3.11.4 HD versus SD ................................ ................................ ................................ ............. 19 3.11.5 Compression and file preparation tips ................................ ................................ ........ 19 3.11.6 Progressive vs Adaptive Streaming ................................ ................................ ........... 19 3.12 Audio ................................ ................................ ................................ ............ 20 3.13 Controls ................................ ................................ ................................ ........ 20 3.13.1 Autoplay ................................ ................................ ................................ ...................... 20 4 Packaging and Testing Your HTML5 Ad ................................ .......... 20 4.1 File size and file load ................................ ................................ ...................... 21 4.1.1 Asset Compression ................................ ................................ ................................ ...... 21 4.1.2 Shared Libraries ................................ ................................ ................................ ........... 21 4.1.3 Zip File Contents ................................ ................................ ................................ .......... 22 4.1.4 File requests ................................ ................................ ................................ ................. 23 4.2 CPU and GPU usage ................................ ................................ ..................... 23 5 Tools ................................ ................................ ................................ ... 24 5.1 For Designers ................................ ................................ ................................ . 24 5.1.1 HTML5 mobile rich media ................................ ................................ ............................. 24 5.1.2 Graphic Development Tools ................................ ................................ ......................... 24 5.1.3 HTML5 Animation Tools ................................ ................................ ............................... 24 5.1.4 Flash converters ................................ ................................ ................................ ........... 25 5.1.5 HTML5 website tools ................................ ................................ ................................ .... 25 5.2 For Developers (Ad Technologists) ................................ ................................ 25 5.2.1 Browser Reference ................................ ................................ ................................ ....... 25 5.2.2 JavaScript Libraries ................................ ................................ ................................ ...... 26 5.2.3 Code compression ................................ ................................ ................................ ........ 26 5.2.4 Image compression ................................ ................................ ................................ ...... 26 5.2.5 Sprite Generators ................................ ................................ ................................ ......... 26 5.2.6 Web fonts technology ................................ ................................ ................................ ... 26 6 Terminology ................................ ................................ ....................... 27"
}