{
    "packaging":  "ZIP must be self-contained with all required assets using relative paths. No external links or dependencies. No nested ZIPs or additional compressed files. Only include files actively referenced by the creative. Filenames must be \u003c= 50 characters and use only letters, numbers, hyphens (-) or underscores (_); no spaces or special characters.",
    "primaryAsset":  "index.html must be located at the root of the ZIP and be a complete HTML document. Must include meta tags for compatibility, at least one exit/clickTag for tracking, and be able to load inside an iframe. All CSS and JavaScript must be referenced as external files (no inline styles or scripts). Accepted sizes: 980x600, 900x500, 1x1, 320x150, 320x250, 300x50, 320x480, 300x60, 600x300, 1920x1080, 468x60, 234x60, 728x90, 970x90, 970x250, 980x120, 980x400, 120x90, 120x60, 120x240, 125x125, 88x31, 200x200, 250x250, 300x250, 240x400, 336x280, 180x150, 300x100, 720x300, 580x400, 120x600, 160x600, 300x600, 728x15, 320x50, 320x100, 300x1050",
    "assetReferences":  "Only include files that are actively referenced in the HTML. Use relative paths for all assets; do not reference external URLs.",
    "orphanAssets":  "Do not include unused or authoring files; keep only assets actively referenced by the creative.",
    "externalResources":  "Do not use externally hosted CSS/JS/images/fonts or hardcoded tracking links. Host all assets locally within the ZIP and reference via relative paths.",
    "httpsOnly":  "All creative files and external references must be served over HTTPS.",
    "clickTags":  "HTML5 display ads must use click tags (clickTag) to direct users to a landing page. The clickTag code must be readable by the ad server (do not minify). The landing page must open in a new tab or window.",
    "iabWeight":  "Initial load \u003c 150 KB; Subload \u003c 300 KB; Total \u003c 512 KB (compressed budgets).",
    "iabRequests":  "Network requests \u003c= 15 (initial).",
    "systemArtifacts":  "Do not include additional compressed files, extra JSON/XML, or backup images inside the ZIP unless specifically required by the ad server.",
    "indexFile":  "index.html must be located at the root of the ZIP (not inside a folder).",
    "timing":  "DOMContentLoaded \u003c 1000 ms (IAB).",
    "domContentLoaded":  "DOMContentLoaded \u003c 1000 ms (IAB).",
    "cpuUsage":  "CPU usage \u003c 500 ms (total long tasks in first 3 seconds).",
    "memoryUsage":  "Memory usage \u003c 10 MB (peak JS heap).",
    "hostedSize":  "Hosted file size \u003c= 2.5 MB (uncompressed)."
}
